function f = fun(x1, x3)
% 输入的 x1 (Toluene) 和 x3 (PIM-1) 现在可以是矩阵
x2 = 1 - x1 - x3;

% --- 物理边界屏蔽 ---
% 体积分数必须在 0 到 1 之间，超出范围的给个 NaN 防止报错
%这个不用改
invalid = (x1 <= 1e-8) | (x2 <=  1e-8) | (x3 <=  1e-8);
x1(invalid) = 0.33; % 临时赋予合法值防止除0报错
x2(invalid) = 0.33;
x3(invalid) = 0.33;

% --- 摩尔体积参数 ---
v1 = 1132.1;     % L8-Bo-c4，不用改了
v2 = 120.6;     % Tol为106.3，oxy为120.6
V31 = 1162.6; % PM6，单体为1042.7，可能需要改大，暂定为2000倍
v3 = 1500*V31; 
s = v1/v2;
r = v1/v3;

% --- 相互作用参数 ---
X13 = 0.447;          % L8-PM6
g23 = 0.572;  % Solvent:Polymer, tol为0.401，oxy为0.356


% 小分子-溶剂参数,这里很奇怪的是，我算的值普遍大100倍，可能需要修改
% p1-p4设置为0是gpt的建议，最后的是强制计算的结果
%考虑到Manus给的数据能计算出结果，所以后面全部沿用Manuse的结果

% p1-p5型的x12解算
% L8:Tol---- 
%p1 = 21.0142; p2 = -53.8880; p3 = 50.9171; p4 = -24.4012; p5 = -1.8875;
%p1 = 0; p2 = 0; p3 = 0; p4 = 0; p5 = 0.4120;
%p1 = 0.8500; p2 = -1.9000; p3 = 1.3500; p4 = -0.6200; p5 = 0.7800;


% L8:oXY---- 
p1 = 16.6738; p2 = -40.8682; p3 = 39.6207; p4 = -19.3621; p5 = -1.5993;
%p1 = 0; p2 = 0; p3 = 0; p4 = 0; p5 = 0.3380;
%p1 = 0.6200; p2 = -1.4500; p3 = 1.0800; p4 = -0.5500; p5 = 0.6600;

%基本变量命名
u1 = x1 ./ (x1 + x2);
u2 = x2 ./ (x1 + x2);

% 逐浓度p1-p5拟合的g12解算
g12 = p1.*u2.^4 + p2.*u2.^3 + p3.*u2.^2 + p4.*u2 + p5;
dg12du = 4.*p1.*u2.^3 + 3.*p2.*u2.^2 + 2.*p3.*u2 + p4;
d2g12du = 12.*p1.*u2.^2 + 6.*p2.*u2 + 2.*p3;

%基于HSP的g12解算
%{
g12 = 0.529;
dg12du = 0;
d2g12du = 0;
%}

% --- 方程计算 ---
G22 = 1./x1 + s.*1./x2 - 2.*g12 + 2.*(1-2.*u2).*dg12du + u1.*u2.*d2g12du;
G23 = 1./x1 - (g12+X13) + s.*g23 + u2.*(1-3.*u2).*dg12du + u1.*u2.^2.*d2g12du;
G33 = 1./x1 + r.*1./x3 - 2.*X13 - 2.*u2.^3.*dg12du + u2.^3.*u1.*d2g12du;

% 旋节线判别式
f_raw= G22.*G33 - G23.^2;
f = f_raw .* (x1 .* x2 .* x3);

% 将不合法的区域剔除
f(invalid) = NaN; 
end